DataProcessors/АнализПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АнализПродукции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТребованиеНакладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНаПроизводство</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыВоспроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыВоспроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТребованиеНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ТребованиеНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Спецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Спецификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяНаПроизводство</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИзделий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Единица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АнализПродукции/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПодобратьТННаСервере()
	Объект.Документы.Очистить();
	ДатаНач = ЭтотОбъект.ДатаНачала;
	ДатаКон = ЭтотОбъект.ДатаКонечная;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТребованиеНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТребованиеНакладная КАК ТребованиеНакладная
		|ГДЕ
		|	ТребованиеНакладная.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаТН из ВыборкаДетальныеЗаписи Цикл
		НоваяСтрока = Объект.Документы.Добавить(); 	
		НоваяСтрока.ТребованиеНакладная = СтрокаТН.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТН(Команда)
	ПодобратьТННаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПродукциюНаСервере()
	Объект.Продукция.Очистить();
	Для каждого СтрокаТН из Объект.Документы Цикл
		ТекДок = СтрокаТН.ТребованиеНакладная.Ссылка;
		ТаблицаПродукции = ТекДок.Продукция.Выгрузить();
		
		Для каждого СтрокаПродукции из ТаблицаПродукции Цикл
			НоваяСтрока = Объект.Продукция.Добавить();
			НоваяСтрока.Номенклатура = СтрокаПродукции.Номенклатура;
			НоваяСтрока.Количество = СтрокаПродукции.Количество;
			НоваяСтрока.Спецификация = СтрокаПродукции.Спецификация;
			НоваяСтрока.ВремяНаПроизводство = СтрокаПродукции.Спецификация.ВремяНаПроизводство;		
		КонецЦикла;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродукцию(Команда)
	ЗаполнитьПродукциюНаСервере();
КонецПроцедуры

&НаСервере
Функция ВывестиОтчетНаСервере()		
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("Номенклатура");
	//ТЗ.Колонки.Добавить("Количество");
	ТабДок = Новый ТабличныйДокумент;
	Макет = Обработки.АнализПродукции.ПолучитьМакет("Макет");
	Шапка = Макет.ПолучитьОбласть("Шапка");
    //ТабДок.Вывести(Шапка);
	
    ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
    ТабДок.Вывести(ШапкаТаблицы);
	Счетчик = 1;
    ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Для Каждого ТекСтрока из Объект.Продукция Цикл
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Номенклатура");
		ТЗ.Колонки.Добавить("Количество");
		ТЗ.КОлонки.Добавить("Остаток");
		ТЗ.Колонки.Добавить("Группа");
		
		ВремяПроизводства = 0;
		ОбластьСтрокаТаблицы.Параметры.Номенклатура = ТекСтрока.Номенклатура;
		ОбластьСтрокаТаблицы.Параметры.Артикул = ТекСтрока.Номенклатура.Артикул;
		ОбластьСтрокаТаблицы.Параметры.Тип = ТекСтрока.Номенклатура.Тип;
		ОбластьСтрокаТаблицы.Параметры.Количество = ТекСтрока.Количество;
		
		//ВремяПроизводства = ТекСтрока.ВремяНаПроизводство;
		//ОбластьСтрокаТаблицы.Параметры.Номер = Счетчик;
    
		//Разворачиваем спецификацию
		Спецификация = ТекСтрока.Спецификация;	
		СуммаВременПроизводства = 0;
		//Функция, которая формирует ТЗ материалов по каждой продукции из первичной табличной части
		ТаблицаМатериаловДляТекущейПродукции = ПолучитьСписокЭлементовСпецификации(Спецификация, ТЗ, СуммаВременПроизводства, ТекСтрока.Количество, 1);
		
		Если СрокПроизводства = Истина Тогда
		ОбластьСтрокаТаблицы.Параметры.Время = СуммаВременПроизводства;
		КонецЕсли;
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
		Если Разузловать = Истина Тогда
			Для Каждого СтрокаТЗ из ТаблицаМатериаловДляТекущейПродукции Цикл
				Счетчик = 0;
				Пробел = "";
				Пока Счетчик < СтрокаТЗ.Группа Цикл
					Пробел = Пробел + "		";
					Счетчик = Счетчик + 1;
				КонецЦикла;	
				
				ВывестиНоменклатуру = Пробел + СтрокаТЗ.Номенклатура;
				ОбластьСтрокаТаблицы.Параметры.Номенклатура = ВывестиНоменклатуру;
				ОбластьСтрокаТаблицы.Параметры.Артикул = СтрокаТЗ.Номенклатура.Артикул;
				ОбластьСтрокаТаблицы.Параметры.Тип = СтрокаТЗ.Номенклатура.Тип;
				ОбластьСтрокаТаблицы.Параметры.Количество = СтрокаТЗ.Количество;
				ОбластьСтрокаТаблицы.Параметры.Время = "";
				ОбластьСтрокаТаблицы.Параметры.Остаток = СтрокаТЗ.Остаток;
				ТабДок.Вывести(ОбластьСтрокаТаблицы);			
			КонецЦикла;
		КонецЕсли;
		
		//Счетчик = Счетчик + 1;
    КонецЦикла;
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    //ТабДок.Вывести(ОбластьПодвал);
    Возврат ТабДок;
		
КонецФункции

&НаСервере
Функция ПолучитьСписокЭлементовСпецификации(Спецификация, ТЗ, Время, Количество, Группа)
	ТекСпецификация = Справочники.Спецификации.НайтиПоНаименованию(Спецификация);
	ГруппаОсн = Группа;
	Время = Время + (ТекСпецификация.ВремяНаПроизводство * Количество);
	КолвоОсновное = Количество;
	//Цикл по спецификациям внутри одной продукции. ТЗ заполняется в рамках одной продукции из основной табличной части в обработке
	Для каждого СтрокаСпецификации из ТекСпецификация.Материалы Цикл		 		
		Группа = ГруппаОсн;
		Если СтрокаСпецификации.Номенклатура.ВидНоменклатуры.ВидВоспроизводства = Перечисления.ВидыВоспроизводства.Производство Тогда
			Количество = СтрокаСпецификации.Количество * Количество;
			Спецификация = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаСпецификации.Номенклатура).ОсновнаяСпецификация.Ссылка;
			
			//Нужно получить остаток. Если остаток на складе есть, то не разузловываем. Если нет, то разузловываем. Если частично, то разузловываем исходя из того, сколько нужно.
			КолВо = 0;
			Если УчитыватьОстатки = Истина Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
					|ИЗ
					|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
					|			&Дата,
					|			Номенклатура = &Номенклатура
					|				И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки";
				
				Запрос.УстановитьПараметр("Дата", Объект.Дата);
				Запрос.УстановитьПараметр("Номенклатура", СтрокаСпецификации.Номенклатура.Ссылка);
				Запрос.УстановитьПараметр("Склад", Склад);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				//Суммируем кол-во по партиям
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					КолВо = КолВо + ВыборкаДетальныеЗаписи.КоличествоОстаток;
				КонецЦикла;
			КонецЕсли;
			
			//Если количества на остатках достаточно, тогда не разузловываем и не спускаемся на уровень ниже. Выводим текущий полуфабрикат
			Если КолВо >= Количество Тогда
				
				СтрТЗ = ТЗ.Добавить();
				СтрТЗ.Номенклатура = СтрокаСпецификации.Номенклатура.Ссылка;
				СтрТЗ.Остаток = КолВо;
				СтрТЗ.Количество = 0;	
				СтрТЗ.Группа = Группа;
				
			//Если количества на остатках нет вообще, тогда разузловываем и как обычно спускаемся на уровень ниже
			ИначеЕсли КолВо = 0 Тогда
				СтрТЗ = ТЗ.Добавить();
				СтрТЗ.Номенклатура = СтрокаСпецификации.Номенклатура.Ссылка;
				СтрТЗ.Остаток = КолВо;
				СтрТЗ.Количество = 0;	
				СтрТЗ.Группа = Группа;

				
				
				ПолучитьСписокЭлементовСпецификации(Спецификация, ТЗ, Время, Количество, Группа + 1);
			//Если количество на остатках меньше чем требуется, то разузловываем исходя из текущей специфики
			ИначеЕсли КолВо < Количество Тогда
				
				//Выводим частично продукцию
				СтрТЗ = ТЗ.Добавить();
				СтрТЗ.Номенклатура = СтрокаСпецификации.Номенклатура.Ссылка;
				СтрТЗ.Остаток = КолВо;
				СтрТЗ.Количество = Количество - КолВо;	
				СтрТЗ.Группа = Группа;
				//Правим количество для подсчета сколько еще нужно
				КоличествоДляРазбора = Количество - КолВо;
				ПолучитьСписокЭлементовСпецификации(Спецификация, ТЗ, Время, КоличествоДляРазбора, Группа + 1);
			КонецЕсли;
	
		//Если текущий элемент является покупным, то не спускаемся на уровень ниже, начинаем его записывать в таблицу	
		Иначе			
			//Если стоит галочка учитывать остатки, указан склад и дата остатков, то дергаем количество по складу
	        Если УчитыватьОстатки = Истина Тогда
				//Получаем остаток на складе
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
					|ИЗ
					|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
					|			&Дата,
					|			Номенклатура = &Номенклатура
					|				И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки";
				
				Запрос.УстановитьПараметр("Дата", Объект.Дата);
				Запрос.УстановитьПараметр("Номенклатура", СтрокаСпецификации.Номенклатура.Ссылка);
				Запрос.УстановитьПараметр("Склад", Склад);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				КолВо = 0;
				//Суммируем кол-во по партиям
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					КолВо = КолВо + ВыборкаДетальныеЗаписи.КоличествоОстаток;
				КонецЦикла;
				
				//Добавляем простой элемент
				СтрТЗ = ТЗ.Добавить();
				СтрТЗ.Номенклатура = СтрокаСпецификации.Номенклатура.Ссылка;
				СтрТЗ.Остаток = КолВо;
				СтрТЗ.Группа = Группа;
				//Если количество на остатках меньше, то минусуем, тем самым показываем сколько надо
				Если КолВо < СтрокаСпецификации.Количество Тогда
					СтрТЗ.Количество = СтрокаСпецификации.Количество - КолВо;
				//Если количество на остатках больше, то количество материала = 0, тк его на остатках достаточно	
				Иначе
					СтрТЗ.Количество = 0;
				КонецЕсли;
			//Если не нужно учитывать остатки на складах, то просто добавляем в таблицу
			Иначе   
				//Добавляем простой элемент
				СтрТЗ = ТЗ.Добавить();
				СтрТЗ.Номенклатура = СтрокаСпецификации.Номенклатура.Ссылка;
				СтрТЗ.Количество = СтрокаСпецификации.Количество * Количество;
				СтрТЗ.Остаток = 0;
				СтрТЗ.Группа = Группа;
			КонецЕсли;						
		КонецЕсли;
		Количество = КолвоОсновное;
	КонецЦикла;
	Возврат ТЗ;
КонецФункции

&НаКлиенте
Процедура ВывестиОтчет(Команда)
	ТабДок = ВывестиОтчетНаСервере();
	ТабДок.Показать("Анализ производства");
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьОстаткиПриИзменении(Элемент)
	Если УчитыватьОстатки = Истина Тогда
		Элементы.Склад.Доступность = Истина;
		Элементы.Дата.Доступность = Истина;
	Иначе
	  	Элементы.Склад.Доступность = Ложь;
		Элементы.Дата.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
